GopalSaraf/Practicals/PSDL/include/proc/pic16f18025.h
extern volatile __bit                   TMR1L5              __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 TMR1L5_bit          _BIT_ACCESS(TMR1L,5)
// TMR1L<TMR1L6>
extern volatile __bit                   TMR1L6              __at(0x1466);	// @ (0x28C * 8 + 6)
#define                                 TMR1L6_bit          _BIT_ACCESS(TMR1L,6)
// TMR1L<TMR1L7>
extern volatile __bit                   TMR1L7              __at(0x1467);	// @ (0x28C * 8 + 7)
#define                                 TMR1L7_bit          _BIT_ACCESS(TMR1L,7)
// T1CON<TMR1ON>
extern volatile __bit                   TMR1ON              __at(0x1470);	// @ (0x28E * 8 + 0)
#define                                 TMR1ON_bit          _BIT_ACCESS(T1CON,0)
// PIE1<TMR2IE>
extern volatile __bit                   TMR2IE              __at(0x4BF);	// @ (0x97 * 8 + 7)
#define                                 TMR2IE_bit          _BIT_ACCESS(PIE1,7)
// PIR1<TMR2IF>
extern volatile __bit                   TMR2IF              __at(0x46F);	// @ (0x8D * 8 + 7)
#define                                 TMR2IF_bit          _BIT_ACCESS(PIR1,7)
// T2CON<TMR2ON>
extern volatile __bit                   TMR2ON              __at(0x1877);	// @ (0x30E * 8 + 7)
#define                                 TMR2ON_bit          _BIT_ACCESS(T2CON,7)
// TMR3L<TMR30>
extern volatile __bit                   TMR30               __at(0x1490);	// @ (0x292 * 8 + 0)
#define                                 TMR30_bit           _BIT_ACCESS(TMR3L,0)
// TMR3L<TMR31>
extern volatile __bit                   TMR31               __at(0x1491);	// @ (0x292 * 8 + 1)
#define                                 TMR31_bit           _BIT_ACCESS(TMR3L,1)
// TMR3H<TMR310>
extern volatile __bit                   TMR310              __at(0x149A);	// @ (0x293 * 8 + 2)
#define                                 TMR310_bit          _BIT_ACCESS(TMR3H,2)
// TMR3H<TMR311>
extern volatile __bit                   TMR311              __at(0x149B);	// @ (0x293 * 8 + 3)
#define                                 TMR311_bit          _BIT_ACCESS(TMR3H,3)
// TMR3H<TMR312>
extern volatile __bit                   TMR312              __at(0x149C);	// @ (0x293 * 8 + 4)
#define                                 TMR312_bit          _BIT_ACCESS(TMR3H,4)
// TMR3H<TMR313>
extern volatile __bit                   TMR313              __at(0x149D);	// @ (0x293 * 8 + 5)
#define                                 TMR313_bit          _BIT_ACCESS(TMR3H,5)
// TMR3H<TMR314>
extern volatile __bit                   TMR314              __at(0x149E);	// @ (0x293 * 8 + 6)
#define                                 TMR314_bit          _BIT_ACCESS(TMR3H,6)
// TMR3H<TMR315>
extern volatile __bit                   TMR315              __at(0x149F);	// @ (0x293 * 8 + 7)
#define                                 TMR315_bit          _BIT_ACCESS(TMR3H,7)
// TMR3L<TMR32>
extern volatile __bit                   TMR32               __at(0x1492);	// @ (0x292 * 8 + 2)
#define                                 TMR32_bit           _BIT_ACCESS(TMR3L,2)
// TMR3L<TMR33>
extern volatile __bit                   TMR33               __at(0x1493);	// @ (0x292 * 8 + 3)
#define                                 TMR33_bit           _BIT_ACCESS(TMR3L,3)
// TMR3L<TMR34>
extern volatile __bit                   TMR34               __at(0x1494);	// @ (0x292 * 8 + 4)
#define                                 TMR34_bit           _BIT_ACCESS(TMR3L,4)
// TMR3L<TMR35>
extern volatile __bit                   TMR35               __at(0x1495);	// @ (0x292 * 8 + 5)
#define                                 TMR35_bit           _BIT_ACCESS(TMR3L,5)
// TMR3L<TMR36>
extern volatile __bit                   TMR36               __at(0x1496);	// @ (0x292 * 8 + 6)
#define                                 TMR36_bit           _BIT_ACCESS(TMR3L,6)
// TMR3L<TMR37>
extern volatile __bit                   TMR37               __at(0x1497);	// @ (0x292 * 8 + 7)
#define                                 TMR37_bit           _BIT_ACCESS(TMR3L,7)
// TMR3H<TMR38>
extern volatile __bit                   TMR38               __at(0x1498);	// @ (0x293 * 8 + 0)
#define                                 TMR38_bit           _BIT_ACCESS(TMR3H,0)
// TMR3H<TMR39>
extern volatile __bit                   TMR39               __at(0x1499);	// @ (0x293 * 8 + 1)
#define                                 TMR39_bit           _BIT_ACCESS(TMR3H,1)
// PIE1<TMR3GIE>
extern volatile __bit                   TMR3GIE             __at(0x4BE);	// @ (0x97 * 8 + 6)
#define                                 TMR3GIE_bit         _BIT_ACCESS(PIE1,6)
// PIR1<TMR3GIF>
extern volatile __bit                   TMR3GIF             __at(0x46E);	// @ (0x8D * 8 + 6)
#define                                 TMR3GIF_bit         _BIT_ACCESS(PIR1,6)
// TMR3H<TMR3H0>
extern volatile __bit                   TMR3H0              __at(0x1498);	// @ (0x293 * 8 + 0)
#define                                 TMR3H0_bit          _BIT_ACCESS(TMR3H,0)
// TMR3H<TMR3H1>
extern volatile __bit                   TMR3H1              __at(0x1499);	// @ (0x293 * 8 + 1)
#define                                 TMR3H1_bit          _BIT_ACCESS(TMR3H,1)
// TMR3H<TMR3H2>
extern volatile __bit                   TMR3H2              __at(0x149A);	// @ (0x293 * 8 + 2)
#define                                 TMR3H2_bit          _BIT_ACCESS(TMR3H,2)
// TMR3H<TMR3H3>
extern volatile __bit                   TMR3H3              __at(0x149B);	// @ (0x293 * 8 + 3)
#define                                 TMR3H3_bit          _BIT_ACCESS(TMR3H,3)
// TMR3H<TMR3H4>
extern volatile __bit                   TMR3H4              __at(0x149C);	// @ (0x293 * 8 + 4)
#define                                 TMR3H4_bit          _BIT_ACCESS(TMR3H,4)
// TMR3H<TMR3H5>
extern volatile __bit                   TMR3H5              __at(0x149D);	// @ (0x293 * 8 + 5)
#define                                 TMR3H5_bit          _BIT_ACCESS(TMR3H,5)
// TMR3H<TMR3H6>
extern volatile __bit                   TMR3H6              __at(0x149E);	// @ (0x293 * 8 + 6)
#define                                 TMR3H6_bit          _BIT_ACCESS(TMR3H,6)
// TMR3H<TMR3H7>
extern volatile __bit                   TMR3H7              __at(0x149F);	// @ (0x293 * 8 + 7)
#define                                 TMR3H7_bit          _BIT_ACCESS(TMR3H,7)
// PIE1<TMR3IE>
extern volatile __bit                   TMR3IE              __at(0x4BD);	// @ (0x97 * 8 + 5)
#define                                 TMR3IE_bit          _BIT_ACCESS(PIE1,5)
// PIR1<TMR3IF>
extern volatile __bit                   TMR3IF              __at(0x46D);	// @ (0x8D * 8 + 5)
#define                                 TMR3IF_bit          _BIT_ACCESS(PIR1,5)
// TMR3L<TMR3L0>
extern volatile __bit                   TMR3L0              __at(0x1490);	// @ (0x292 * 8 + 0)
#define                                 TMR3L0_bit          _BIT_ACCESS(TMR3L,0)
// TMR3L<TMR3L1>
extern volatile __bit                   TMR3L1              __at(0x1491);	// @ (0x292 * 8 + 1)
#define                                 TMR3L1_bit          _BIT_ACCESS(TMR3L,1)
// TMR3L<TMR3L2>
extern volatile __bit                   TMR3L2              __at(0x1492);	// @ (0x292 * 8 + 2)
#define                                 TMR3L2_bit          _BIT_ACCESS(TMR3L,2)
// TMR3L<TMR3L3>
extern volatile __bit                   TMR3L3              __at(0x1493);	// @ (0x292 * 8 + 3)
#define                                 TMR3L3_bit          _BIT_ACCESS(TMR3L,3)
// TMR3L<TMR3L4>
extern volatile __bit                   TMR3L4              __at(0x1494);	// @ (0x292 * 8 + 4)
#define                                 TMR3L4_bit          _BIT_ACCESS(TMR3L,4)
// TMR3L<TMR3L5>
extern volatile __bit                   TMR3L5              __at(0x1495);	// @ (0x292 * 8 + 5)
#define                                 TMR3L5_bit          _BIT_ACCESS(TMR3L,5)
// TMR3L<TMR3L6>
extern volatile __bit                   TMR3L6              __at(0x1496);	// @ (0x292 * 8 + 6)
#define                                 TMR3L6_bit          _BIT_ACCESS(TMR3L,6)
// TMR3L<TMR3L7>
extern volatile __bit                   TMR3L7              __at(0x1497);	// @ (0x292 * 8 + 7)
#define                                 TMR3L7_bit          _BIT_ACCESS(TMR3L,7)
// T3CON<TMR3ON>
extern volatile __bit                   TMR3ON              __at(0x14A0);	// @ (0x294 * 8 + 0)
#define                                 TMR3ON_bit          _BIT_ACCESS(T3CON,0)
// PIE2<TMR4IE>
extern volatile __bit                   TMR4IE              __at(0x4C0);	// @ (0x98 * 8 + 0)
#define                                 TMR4IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<TMR4IF>
extern volatile __bit                   TMR4IF              __at(0x470);	// @ (0x8E * 8 + 0)
#define                                 TMR4IF_bit          _BIT_ACCESS(PIR2,0)
// T4CON<TMR4ON>
extern volatile __bit                   TMR4ON              __at(0x18A7);	// @ (0x314 * 8 + 7)
#define                                 TMR4ON_bit          _BIT_ACCESS(T4CON,7)
// PIE2<TMR6IE>
extern volatile __bit                   TMR6IE              __at(0x4C1);	// @ (0x98 * 8 + 1)
#define                                 TMR6IE_bit          _BIT_ACCESS(PIE2,1)
// PIR2<TMR6IF>
extern volatile __bit                   TMR6IF              __at(0x471);	// @ (0x8E * 8 + 1)
#define                                 TMR6IF_bit          _BIT_ACCESS(PIR2,1)
// T6CON<TMR6ON>
extern volatile __bit                   TMR6ON              __at(0x18D7);	// @ (0x31A * 8 + 7)
#define                                 TMR6ON_bit          _BIT_ACCESS(T6CON,7)
// TOSH<TOSH0>
extern volatile __bit                   TOSH0               __at(0xFF78);	// @ (0x1FEF * 8 + 0)
#define                                 TOSH0_bit           _BIT_ACCESS(TOSH,0)
// TOSH<TOSH1>
extern volatile __bit                   TOSH1               __at(0xFF79);	// @ (0x1FEF * 8 + 1)
#define                                 TOSH1_bit           _BIT_ACCESS(TOSH,1)
// TOSH<TOSH2>
extern volatile __bit                   TOSH2               __at(0xFF7A);	// @ (0x1FEF * 8 + 2)
#define                                 TOSH2_bit           _BIT_ACCESS(TOSH,2)
// TOSH<TOSH3>
extern volatile __bit                   TOSH3               __at(0xFF7B);	// @ (0x1FEF * 8 + 3)
#define                                 TOSH3_bit           _BIT_ACCESS(TOSH,3)
// TOSH<TOSH4>
extern volatile __bit                   TOSH4               __at(0xFF7C);	// @ (0x1FEF * 8 + 4)
#define                                 TOSH4_bit           _BIT_ACCESS(TOSH,4)
// TOSH<TOSH5>
extern volatile __bit                   TOSH5               __at(0xFF7D);	// @ (0x1FEF * 8 + 5)
#define                                 TOSH5_bit           _BIT_ACCESS(TOSH,5)
// TOSH<TOSH6>
extern volatile __bit                   TOSH6               __at(0xFF7E);	// @ (0x1FEF * 8 + 6)
#define                                 TOSH6_bit           _BIT_ACCESS(TOSH,6)
// TOSH<TOSH7>
extern volatile __bit                   TOSH7               __at(0xFF7F);	// @ (0x1FEF * 8 + 7)
#define                                 TOSH7_bit           _BIT_ACCESS(TOSH,7)
// TOSL<TOSL0>
extern volatile __bit                   TOSL0               __at(0xFF70);	// @ (0x1FEE * 8 + 0)
#define                                 TOSL0_bit           _BIT_ACCESS(TOSL,0)
// TOSL<TOSL1>
extern volatile __bit                   TOSL1               __at(0xFF71);	// @ (0x1FEE * 8 + 1)
#define                                 TOSL1_bit           _BIT_ACCESS(TOSL,1)
// TOSL<TOSL2>
extern volatile __bit                   TOSL2               __at(0xFF72);	// @ (0x1FEE * 8 + 2)
#define                                 TOSL2_bit           _BIT_ACCESS(TOSL,2)
// TOSL<TOSL3>
extern volatile __bit                   TOSL3               __at(0xFF73);	// @ (0x1FEE * 8 + 3)
#define                                 TOSL3_bit           _BIT_ACCESS(TOSL,3)
// TOSL<TOSL4>
extern volatile __bit                   TOSL4               __at(0xFF74);	// @ (0x1FEE * 8 + 4)
#define                                 TOSL4_bit           _BIT_ACCESS(TOSL,4)
// TOSL<TOSL5>
extern volatile __bit                   TOSL5               __at(0xFF75);	// @ (0x1FEE * 8 + 5)
#define                                 TOSL5_bit           _BIT_ACCESS(TOSL,5)
// TOSL<TOSL6>
extern volatile __bit                   TOSL6               __at(0xFF76);	// @ (0x1FEE * 8 + 6)
#define                                 TOSL6_bit           _BIT_ACCESS(TOSL,6)
// TOSL<TOSL7>
extern volatile __bit                   TOSL7               __at(0xFF77);	// @ (0x1FEE * 8 + 7)
#define                                 TOSL7_bit           _BIT_ACCESS(TOSL,7)
// TRISA<TRISA0>
extern volatile __bit                   TRISA0              __at(0x90);	// @ (0x12 * 8 + 0)
#define                                 TRISA0_bit          _BIT_ACCESS(TRISA,0)
// TRISA<TRISA1>
extern volatile __bit                   TRISA1              __at(0x91);	// @ (0x12 * 8 + 1)
#define                                 TRISA1_bit          _BIT_ACCESS(TRISA,1)
// TRISA<TRISA2>
extern volatile __bit                   TRISA2              __at(0x92);	// @ (0x12 * 8 + 2)
#define                                 TRISA2_bit          _BIT_ACCESS(TRISA,2)
// TRISA<TRISA4>
extern volatile __bit                   TRISA4              __at(0x94);	// @ (0x12 * 8 + 4)
#define                                 TRISA4_bit          _BIT_ACCESS(TRISA,4)
// TRISA<TRISA5>
extern volatile __bit                   TRISA5              __at(0x95);	// @ (0x12 * 8 + 5)
#define                                 TRISA5_bit          _BIT_ACCESS(TRISA,5)
// TRISC<TRISC0>
extern volatile __bit                   TRISC0              __at(0xA0);	// @ (0x14 * 8 + 0)
#define                                 TRISC0_bit          _BIT_ACCESS(TRISC,0)
// TRISC<TRISC1>
extern volatile __bit                   TRISC1              __at(0xA1);	// @ (0x14 * 8 + 1)
#define                                 TRISC1_bit          _BIT_ACCESS(TRISC,1)
// TRISC<TRISC2>
extern volatile __bit                   TRISC2              __at(0xA2);	// @ (0x14 * 8 + 2)
#define                                 TRISC2_bit          _BIT_ACCESS(TRISC,2)
// TRISC<TRISC3>
extern volatile __bit                   TRISC3              __at(0xA3);	// @ (0x14 * 8 + 3)
#define                                 TRISC3_bit          _BIT_ACCESS(TRISC,3)
// TRISC<TRISC4>
extern volatile __bit                   TRISC4              __at(0xA4);	// @ (0x14 * 8 + 4)
#define                                 TRISC4_bit          _BIT_ACCESS(TRISC,4)
// TRISC<TRISC5>
extern volatile __bit                   TRISC5              __at(0xA5);	// @ (0x14 * 8 + 5)
#define                                 TRISC5_bit          _BIT_ACCESS(TRISC,5)
// FVRCON<TSEN>
extern volatile __bit                   TSEN                __at(0x8065);	// @ (0x100C * 8 + 5)
#define                                 TSEN_bit            _BIT_ACCESS(FVRCON,5)
// FVRCON<TSRNG>
extern volatile __bit                   TSRNG               __at(0x8064);	// @ (0x100C * 8 + 4)
#define                                 TSRNG_bit           _BIT_ACCESS(FVRCON,4)
// OSCTUNE<TUN0>
extern volatile __bit                   TUN0                __at(0x1090);	// @ (0x212 * 8 + 0)
#define                                 TUN0_bit            _BIT_ACCESS(OSCTUNE,0)
// OSCTUNE<TUN1>
extern volatile __bit                   TUN1                __at(0x1091);	// @ (0x212 * 8 + 1)
#define                                 TUN1_bit            _BIT_ACCESS(OSCTUNE,1)
// OSCTUNE<TUN2>
extern volatile __bit                   TUN2                __at(0x1092);	// @ (0x212 * 8 + 2)
#define                                 TUN2_bit            _BIT_ACCESS(OSCTUNE,2)
// OSCTUNE<TUN3>
extern volatile __bit                   TUN3                __at(0x1093);	// @ (0x212 * 8 + 3)
#define                                 TUN3_bit            _BIT_ACCESS(OSCTUNE,3)
// OSCTUNE<TUN4>
extern volatile __bit                   TUN4                __at(0x1094);	// @ (0x212 * 8 + 4)
#define                                 TUN4_bit            _BIT_ACCESS(OSCTUNE,4)
// OSCTUNE<TUN5>
extern volatile __bit                   TUN5                __at(0x1095);	// @ (0x212 * 8 + 5)
#define                                 TUN5_bit            _BIT_ACCESS(OSCTUNE,5)
// PIE3<TX1IE>
extern volatile __bit                   TX1IE               __at(0x4CA);	// @ (0x99 * 8 + 2)
#define                                 TX1IE_bit           _BIT_ACCESS(PIE3,2)
// PIR3<TX1IF>
extern volatile __bit                   TX1IF               __at(0x47A);	// @ (0x8F * 8 + 2)
#define                                 TX1IF_bit           _BIT_ACCESS(PIR3,2)
// PIE3<TX2IE>
extern volatile __bit                   TX2IE               __at(0x4CC);	// @ (0x99 * 8 + 4)
#define                                 TX2IE_bit           _BIT_ACCESS(PIE3,4)
// PIR3<TX2IF>
extern volatile __bit                   TX2IF               __at(0x47C);	// @ (0x8F * 8 + 4)
#define                                 TX2IF_bit           _BIT_ACCESS(PIR3,4)
// SSP1STAT<UA1>
extern volatile __bit                   UA1                 __at(0x3479);	// @ (0x68F * 8 + 1)
#define                                 UA1_bit             _BIT_ACCESS(SSP1STAT,1)
// SSP2STAT<UA2>
extern volatile __bit                   UA2                 __at(0x34C9);	// @ (0x699 * 8 + 1)
#define                                 UA2_bit             _BIT_ACCESS(SSP2STAT,1)
// ADUTHL<UTH0>
extern volatile __bit                   UTH0                __at(0xE870);	// @ (0x1D0E * 8 + 0)
#define                                 UTH0_bit            _BIT_ACCESS(ADUTHL,0)
// ADUTHL<UTH1>
extern volatile __bit                   UTH1                __at(0xE871);	// @ (0x1D0E * 8 + 1)
#define                                 UTH1_bit            _BIT_ACCESS(ADUTHL,1)
// ADUTHH<UTH10>
extern volatile __bit                   UTH10               __at(0xE87A);	// @ (0x1D0F * 8 + 2)
#define                                 UTH10_bit           _BIT_ACCESS(ADUTHH,2)
// ADUTHH<UTH11>
extern volatile __bit                   UTH11               __at(0xE87B);	// @ (0x1D0F * 8 + 3)
#define                                 UTH11_bit           _BIT_ACCESS(ADUTHH,3)
// ADUTHH<UTH12>
extern volatile __bit                   UTH12               __at(0xE87C);	// @ (0x1D0F * 8 + 4)
#define                                 UTH12_bit           _BIT_ACCESS(ADUTHH,4)
// ADUTHH<UTH13>
extern volatile __bit                   UTH13               __at(0xE87D);	// @ (0x1D0F * 8 + 5)
#define                                 UTH13_bit           _BIT_ACCESS(ADUTHH,5)
// ADUTHH<UTH14>
extern volatile __bit                   UTH14               __at(0xE87E);	// @ (0x1D0F * 8 + 6)
#define                                 UTH14_bit           _BIT_ACCESS(ADUTHH,6)
// ADUTHH<UTH15>
extern volatile __bit                   UTH15               __at(0xE87F);	// @ (0x1D0F * 8 + 7)
#define                                 UTH15_bit           _BIT_ACCESS(ADUTHH,7)
// ADUTHL<UTH2>
extern volatile __bit                   UTH2                __at(0xE872);	// @ (0x1D0E * 8 + 2)
#define                                 UTH2_bit            _BIT_ACCESS(ADUTHL,2)
// ADUTHL<UTH3>
extern volatile __bit                   UTH3                __at(0xE873);	// @ (0x1D0E * 8 + 3)
#define                                 UTH3_bit            _BIT_ACCESS(ADUTHL,3)
// ADUTHL<UTH4>
extern volatile __bit                   UTH4                __at(0xE874);	// @ (0x1D0E * 8 + 4)
#define                                 UTH4_bit            _BIT_ACCESS(ADUTHL,4)
// ADUTHL<UTH5>
extern volatile __bit                   UTH5                __at(0xE875);	// @ (0x1D0E * 8 + 5)
#define                                 UTH5_bit            _BIT_ACCESS(ADUTHL,5)
// ADUTHL<UTH6>
extern volatile __bit                   UTH6                __at(0xE876);	// @ (0x1D0E * 8 + 6)
#define                                 UTH6_bit            _BIT_ACCESS(ADUTHL,6)
// ADUTHL<UTH7>
extern volatile __bit                   UTH7                __at(0xE877);	// @ (0x1D0E * 8 + 7)
#define                                 UTH7_bit            _BIT_ACCESS(ADUTHL,7)
// ADUTHH<UTH8>
extern volatile __bit                   UTH8                __at(0xE878);	// @ (0x1D0F * 8 + 0)
#define                                 UTH8_bit            _BIT_ACCESS(ADUTHH,0)
// ADUTHH<UTH9>
extern volatile __bit                   UTH9                __at(0xE879);	// @ (0x1D0F * 8 + 1)
#define                                 UTH9_bit            _BIT_ACCESS(ADUTHH,1)
// ADSTAT<UTHR>
extern volatile __bit                   UTHR                __at(0xE956);	// @ (0x1D2A * 8 + 6)
#define                                 UTHR_bit            _BIT_ACCESS(ADSTAT,6)
// SSP1CON1<WCOL1>
extern volatile __bit                   WCOL1               __at(0x3487);	// @ (0x690 * 8 + 7)
#define                                 WCOL1_bit           _BIT_ACCESS(SSP1CON1,7)
// SSP2CON1<WCOL2>
extern volatile __bit                   WCOL2               __at(0x34D7);	// @ (0x69A * 8 + 7)
#define                                 WCOL2_bit           _BIT_ACCESS(SSP2CON1,7)
// WDTCON<WDTCS>
extern volatile __bit                   WDTCS               __at(0xC67);	// @ (0x18C * 8 + 7)
#define                                 WDTCS_bit           _BIT_ACCESS(WDTCON,7)
// WDTCON<WDTPS0>
extern volatile __bit                   WDTPS0              __at(0xC61);	// @ (0x18C * 8 + 1)
#define                                 WDTPS0_bit          _BIT_ACCESS(WDTCON,1)
// WDTCON<WDTPS1>
extern volatile __bit                   WDTPS1              __at(0xC62);	// @ (0x18C * 8 + 2)
#define                                 WDTPS1_bit          _BIT_ACCESS(WDTCON,2)
// WDTCON<WDTPS2>
extern volatile __bit                   WDTPS2              __at(0xC63);	// @ (0x18C * 8 + 3)
#define                                 WDTPS2_bit          _BIT_ACCESS(WDTCON,3)
// WDTCON<WDTPS3>
extern volatile __bit                   WDTPS3              __at(0xC64);	// @ (0x18C * 8 + 4)
#define                                 WDTPS3_bit          _BIT_ACCESS(WDTCON,4)
// WDTCON<WDTPS4>
extern volatile __bit                   WDTPS4              __at(0xC65);	// @ (0x18C * 8 + 5)
#define                                 WDTPS4_bit          _BIT_ACCESS(WDTCON,5)
// WPUA<WPUA0>
extern volatile __bit                   WPUA0               __at(0xF468);	// @ (0x1E8D * 8 + 0)
#define                                 WPUA0_bit           _BIT_ACCESS(WPUA,0)
// WPUA<WPUA1>
extern volatile __bit                   WPUA1               __at(0xF469);	// @ (0x1E8D * 8 + 1)
#define                                 WPUA1_bit           _BIT_ACCESS(WPUA,1)
// WPUA<WPUA2>
extern volatile __bit                   WPUA2               __at(0xF46A);	// @ (0x1E8D * 8 + 2)
#define                                 WPUA2_bit           _BIT_ACCESS(WPUA,2)
// WPUA<WPUA3>
extern volatile __bit                   WPUA3               __at(0xF46B);	// @ (0x1E8D * 8 + 3)
#define                                 WPUA3_bit           _BIT_ACCESS(WPUA,3)
// WPUA<WPUA4>
extern volatile __bit                   WPUA4               __at(0xF46C);	// @ (0x1E8D * 8 + 4)
#define                                 WPUA4_bit           _BIT_ACCESS(WPUA,4)
// WPUA<WPUA5>
extern volatile __bit                   WPUA5               __at(0xF46D);	// @ (0x1E8D * 8 + 5)
#define                                 WPUA5_bit           _BIT_ACCESS(WPUA,5)
// WPUC<WPUC0>
extern volatile __bit                   WPUC0               __at(0xF508);	// @ (0x1EA1 * 8 + 0)
#define                                 WPUC0_bit           _BIT_ACCESS(WPUC,0)
// WPUC<WPUC1>
extern volatile __bit                   WPUC1               __at(0xF509);	// @ (0x1EA1 * 8 + 1)
#define                                 WPUC1_bit           _BIT_ACCESS(WPUC,1)
// WPUC<WPUC2>
extern volatile __bit                   WPUC2               __at(0xF50A);	// @ (0x1EA1 * 8 + 2)
